Revit 2027 API
BuiltInFailures.DimensionFailures.ForbiddenGroupConstraint Property
 You may not create sketch or family constraints between group members and elements which are not members of the same group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ForbiddenGroupConstraint { get; }
Public Shared ReadOnly Property ForbiddenGroupConstraint As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ForbiddenGroupConstraint {
	FailureDefinitionId^ get ();
}
static member ForbiddenGroupConstraint : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace